
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	#Область Добавить_Группы
	
	ГруппаСтраницы = РаботаСФормами.ДобавитьСтраницы(
		ЭтаФорма,
		"ГруппаСтраницы");
		
	СтраницаГруппы = РаботаСФормами.ДобавитьСтраницу(
		ЭтаФорма,
		"СтраницаГруппы",
		ГруппаСтраницы,
		"Группы");
	
	ГруппаКолонки = РаботаСФормами.ДобавитьОбычнуюГруппу(
		ЭтаФорма,
		"ГруппаКолонки",
		"Группа Колонки",
		СтраницаГруппы,
		,
		ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно);
	
	ГруппаКолонкиЛево = РаботаСФормами.ДобавитьОбычнуюГруппу(
		ЭтаФорма,
		"ГруппаКолонкиЛево",
		,
		ГруппаКолонки,
		,
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	
	ГруппаКолонкиПраво = РаботаСФормами.ДобавитьОбычнуюГруппу(
		ЭтаФорма,
		"ГруппаКолонкиПраво",
		,
		ГруппаКолонки,
		,
		ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
		
	ДекорацияЛеваяКолонка = РаботаСФормами.ДобавитьНадпись(
		ЭтаФорма,
		"ДекорацияЛеваяКолонка",
		ГруппаКолонкиЛево,
		"Левая колонка");
	ДекорацияПраваяКолонка = РаботаСФормами.ДобавитьНадпись(
		ЭтаФорма,
		"ДекорацияПраваяКолонка",
		ГруппаКолонкиПраво,
		"Правая колонка");
	
	#КонецОбласти
	
	#Область Добавить_Поля

	СтраницаПоля = РаботаСФормами.ДобавитьСтраницу(
		ЭтаФорма,
		"СтраницаПоля",
		ГруппаСтраницы,
		"Поля");
	
	РаботаСФормами.ДобавитьРеквизит(ЭтаФорма, "РеквизитПоляВвода", РаботаСФормами.ОписаниеТипаСтрока(50));
	ПолеВвода = РаботаСФормами.ДобавитьПоле(
		ЭтаФорма,
		"ПолеВвода",
		СтраницаПоля,
		,
		"Поле ввода",
		ВидПоляФормы.ПолеВвода,
		"РеквизитПоляВвода");
	
	РаботаСФормами.ДобавитьРеквизит(ЭтаФорма, "РеквизитПоляФлажка", РаботаСФормами.ОписаниеТипаБулево());
	ПолеФлажка = РаботаСФормами.ДобавитьПолеФлажка(
		ЭтаФорма,
		"ПолеФлажка",
		СтраницаПоля,
		,
		"Поле Флажка",
		,
		"РеквизитПоляФлажка");
		
	РеквизитПоляНадписи = РаботаСФормами.ДобавитьРеквизит(ЭтаФорма, "РеквизитПоляНадписи", РаботаСФормами.ОписаниеТипаСтрока(50));
	ЭтаФорма[РеквизитПоляНадписи.Имя] = "Надпись";
	
	ПолеНадписи = РаботаСФормами.ДобавитьПолеНадписи(
		ЭтаФорма,
		"ПолеНадписи",
		СтраницаПоля,
		,
		"Поле надписи",
		"РеквизитПоляНадписи");
		
	РеквизитКартинка = РаботаСФормами.ДобавитьРеквизит(ЭтаФорма, "РеквизитПолеКартинки", РаботаСФормами.ОписаниеТипаСтрока(250));
	ЭтаФорма[РеквизитКартинка.Имя] = ПоместитьВоВременноеХранилище(ПолучитьОбщийМакет("РСФ_ОбразецКартинки"), УникальныйИдентификатор);
	
	ПолеКартинки = РаботаСФормами.ДобавитьПолеКартинки(
		ЭтаФорма,
		"ПолеКартинки",
		СтраницаПоля,
		"РеквизитПолеКартинки");
	ПолеКартинки.Заголовок = "Поле картинки";
	ПолеКартинки.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Лево;
	
	
	ЗначенияВыпадающегоСписка = СтрРазделить("Один,Два,Три", ",", Ложь);
	ВыпадающийСписок = РаботаСФормами.ДобавитьВыпадающийСписок(
		ЭтаФорма,
		"ВыпадающийСписок",
		СтраницаПоля,
		"Выпадающий список",
		РаботаСФормами.ОписаниеТипаСтрока(10),
		ЗначенияВыпадающегоСписка);
	
	ЗначенияПереключателя = СтрРазделить("Один,Два,Три", ",", Ложь);
	Переключатель = РаботаСФормами.ДобавитьПереключатель(
		ЭтаФорма,
		"Переключатель",
		СтраницаПоля,
		ЗначенияПереключателя,
		"Переключатель");
	
	
	#КонецОбласти
	
	
	#Область ДекорацииФормы
	
	СтраницаДекорации = РаботаСФормами.ДобавитьСтраницу(
		ЭтаФорма,
		"СтраницаДекорации",
		ГруппаСтраницы,
		"Декорации");
	
	ДекорацияНадпись = РаботаСФормами.ДобавитьНадпись(
		ЭтаФорма,
		"ДекорацияНадпись",
		СтраницаДекорации,
		"Декорация Надпись");
		
	ДекорацияОтступ = РаботаСФормами.ДобавитьОтступ(
		ЭтаФорма,
		"ДекорацияОтступ",
		СтраницаДекорации,
		2);
	
	ДекорацияКартинка = РаботаСФормами.ДобавитьКартинку(
		ЭтаФорма,
		"ДекорацияКартинка",
		СтраницаДекорации,
		БиблиотекаКартинок.АктивироватьЗадачу);
	
	#КонецОбласти
	
	
	#Область КнопкиИ_Команды
	СтраницаКнопки = РаботаСФормами.ДобавитьСтраницу(
		ЭтаФорма,
		"СтраницаКнопки",
		ГруппаСтраницы,
		"Кнопки и команды");
		
	Команда = РаботаСФормами.ДобавитьКоманду(
		ЭтаФорма,
		"СозданиеКомандыИ_Кнопки",
		"Создание команды и кнопки",
		"ОбработчикКоманды",
		БиблиотекаКартинок.АктивироватьЗадачу);
		
	КнопкаФормы = РаботаСФормами.ДобавитьКнопку(
		ЭтаФорма,
		"КнопкаФормы",
		СтраницаКнопки,
		"Кнопка",
		Команда.Имя);
	#КонецОбласти
	
	
	#Область КнопкиИ_Команды
	
	СтраницаУдаление = РаботаСФормами.ДобавитьСтраницу(
		ЭтаФорма,
		"СтраницаУдаление",
		ГруппаСтраницы,
		"Удаление");
	
	ДекорацияНадписьУдаление = РаботаСФормами.ДобавитьНадпись(
		ЭтаФорма,
		"ДекорацияНадписьУдаление",
		СтраницаУдаление,
		"Удалим элементы под надписью");
		
	ДекорацияОтступУдаление = РаботаСФормами.ДобавитьОтступ(
		ЭтаФорма,
		"ДекорацияОтступУдаление",
		СтраницаУдаление,
		2);
	
	ЗначенияПереключателя = СтрРазделить("Один,Два,Три", ",", Ложь);
	ПереключательУдаление = РаботаСФормами.ДобавитьПереключатель(
		ЭтаФорма,
		"ПереключательУдаление",
		СтраницаУдаление,
		ЗначенияПереключателя,
		"Переключатель удаление");
		
	УдаляемыйРеквизит = РаботаСФормами.ДобавитьРеквизит(ЭтаФорма, "УдаляемыйРеквизит", РаботаСФормами.ОписаниеТипаСтрока(250));
		
	УдаляемаяКоманда = РаботаСФормами.ДобавитьКоманду(
		ЭтаФорма,
		"УдаляемаяКоманда",
		"Удаляемая команда",
		,
		БиблиотекаКартинок.АктивироватьЗадачу);
		
	ДекорацияНадписьУдалениеПосле = РаботаСФормами.ДобавитьНадпись(
		ЭтаФорма,
		"ДекорацияНадписьУдалениеПосле",
		СтраницаУдаление,
		"Над этой надписью удалены элементы");
	
	РаботаСФормами.УдалитьЭлемент(ЭтаФорма, "ДекорацияОтступУдаление");
	РаботаСФормами.УдалитьЭлементИРеквизитФормы(ЭтаФорма, "ПереключательУдаление");
	РаботаСФормами.УдалитьРеквизит(ЭтаФорма, "УдаляемыйРеквизит");
	РаботаСФормами.УдалитьКоманду(ЭтаФорма, "УдаляемаяКоманда");
	
	#КонецОбласти
	
	
	#Область Таблицы
	СтраницаТаблицы = РаботаСФормами.ДобавитьСтраницу(
		ЭтаФорма,
		"СтраницаТаблицы",
		ГруппаСтраницы,
		"Таблицы");
	
	ТекстЗапроса = ТекстЗапросаДинамическогоСписка();
	СтруктураКолонок = СтруктураКолонокДинамическогоСписка();
		

	ДинамическийСписок = РаботаСФормами.ДобавитьДинамическийСписок(
		ЭтаФорма,
		"ДинамическийСписок",
		СтраницаТаблицы,
		СтруктураКолонок,
		ТекстЗапроса);
	
	
	
	#КонецОбласти
	

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикКоманды(Команда)
	ПоказатьПредупреждение(,"Есть контакт!");
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекстЗапросаДинамическогоСписка()
	
	Возврат
	"ВЫБРАТЬ
	|	1 КАК Цифра
	|ПОМЕСТИТЬ Цифры
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	2
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	3
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	4
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	5
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	6
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	7
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	8
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	9
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Десятки.Цифра КАК Десятки,
	|	Единицы.Цифра КАК Единицы,
	|	Единицы.Цифра + Десятки.Цифра * 10 КАК Число
	|ИЗ
	|	Цифры КАК Единицы
	|		ЛЕВОЕ СОЕДИНЕНИЕ Цифры КАК Десятки
	|		ПО (ИСТИНА)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Число";
	
		
КонецФункции

&НаСервереБезКонтекста
Функция СтруктураКолонокДинамическогоСписка()
	
	СтруктураКолонок = Новый Структура;
	СтруктураКолонок.Вставить("Десятки");
	СтруктураКолонок.Вставить("Единицы");
	СтруктураКолонок.Вставить("Число", "Результат");
	
	Возврат СтруктураКолонок;
	
КонецФункции
